[
  {"id":1,"joke":"Why don’t eggs tell jokes? They’d crack each other up.","type":"general"},
  {"id":2,"joke":"I used to play piano by ear, but now I use my hands.","type":"general"},
  {"id":3,"joke":"Why did the invisible man turn down the job? He couldn’t see himself doing it.","type":"general"},
  {"id":4,"joke":"I told my suitcase we’re not going on vacation. Now it’s emotional baggage.","type":"general"},
  {"id":5,"joke":"Why did the barber win the race? He took a short cut.","type":"general"},
  {"id":6,"joke":"I’m reading a book about mazes. I’m getting lost in it.","type":"general"},
  {"id":7,"joke":"Why did the skeleton go to the party alone? He had no body to go with.","type":"general"},
  {"id":8,"joke":"I don’t trust trees. They seem kind of shady.","type":"general"},
  {"id":9,"joke":"Why was the broom promoted? It swept the competition.","type":"general"},
  {"id":10,"joke":"I told my friend 10 jokes to make him laugh. Sadly, no pun in ten did.","type":"general"},
  {"id":11,"joke":"Why did the orange stop? It ran out of juice.","type":"general"},
  {"id":12,"joke":"Why was the calendar nervous? Its days were numbered.","type":"general"},
  {"id":13,"joke":"I quit my job at the helium factory. I refused to be spoken to in that tone.","type":"general"},
  {"id":14,"joke":"Why don’t scientists trust stairs? They’re always up to something.","type":"general"},
  {"id":15,"joke":"The baker quit his job. He couldn’t make enough dough.","type":"general"},
  {"id":16,"joke":"Why do bees have sticky hair? Because they use honeycombs.","type":"general"},
  {"id":17,"joke":"I bought a boat because it was on sail.","type":"general"},
  {"id":18,"joke":"Why don’t some fish get good grades? They work below sea level.","type":"general"},
  {"id":19,"joke":"I used to be a banker, but I lost interest.","type":"general"},
  {"id":20,"joke":"Why did the banana go to the doctor? It wasn’t peeling well.","type":"general"},
  {"id":21,"joke":"I told my computer I needed a break, and now it won’t stop sending me kit-kats.","type":"general"},
  {"id":22,"joke":"Why was the stadium so cool? It was filled with fans.","type":"general"},
  {"id":23,"joke":"What do you call a boomerang that doesn’t come back? A stick.","type":"general"},
  {"id":24,"joke":"I’m on a seafood diet. I see food and I eat it.","type":"general"},
  {"id":25,"joke":"Why did the tomato turn red? It saw the salad dressing.","type":"general"},
  {"id":26,"joke":"What do you call a sleeping bull? A bulldozer.","type":"general"},
  {"id":27,"joke":"Why did the golfer bring two pants? In case he got a hole in one.","type":"general"},
  {"id":28,"joke":"I used to hate facial hair, but then it grew on me.","type":"general"},
  {"id":29,"joke":"Why don’t crabs donate? They’re shellfish.","type":"general"},
  {"id":30,"joke":"I couldn’t figure out why my car was acting funny — then it hit me.","type":"general"},
  {"id":31,"joke":"What do you call a factory that makes okay products? A satisfactory.","type":"general"},
  {"id":32,"joke":"Why did the bicycle fall over? It was two-tired.","type":"general"},
  {"id":33,"joke":"I tried to catch fog yesterday. Mist.","type":"general"},
  {"id":34,"joke":"What do clouds wear? Thunderwear.","type":"general"},
  {"id":35,"joke":"Why was the belt arrested? It held up a pair of pants.","type":"general"},
  {"id":36,"joke":"I told a joke about a bed. It hasn’t been made yet.","type":"general"},
  {"id":37,"joke":"What do you call fake noodles? An impasta.","type":"general"},
  {"id":38,"joke":"Why don’t vampires go to barbecues? They don’t like steaks.","type":"general"},
  {"id":39,"joke":"Why was the cookie sad? It felt crumby.","type":"general"},
  {"id":40,"joke":"What kind of music do planets like? Neptunes.","type":"general"},
  {"id":41,"joke":"Why can’t you trust atoms? They make up everything.","type":"general"},
  {"id":42,"joke":"Why was the computer cold? It forgot to close its windows.","type":"general"},
  {"id":43,"joke":"What did the grape do when stepped on? Nothing, it just let out a little wine.","type":"general"},
  {"id":44,"joke":"I used to have a job crushing cans. It was soda pressing.","type":"general"},
  {"id":45,"joke":"Why did the scarecrow win an award? He was outstanding in his field.","type":"general"},
  {"id":46,"joke":"My dog ate my homework, so I ate my dog’s food. Fair trade.","type":"general"},
  {"id":47,"joke":"Why don’t melons get married? They cantaloupe.","type":"general"},
  {"id":48,"joke":"I told my wife she drew her eyebrows too high. She looked surprised.","type":"general"},
  {"id":49,"joke":"I told a chemistry joke, but I got no reaction.","type":"general"},
  {"id":50,"joke":"Why are elevator jokes so good? They work on many levels.","type":"general"},
  {"id":51,"joke":"Why don’t oysters share? Because they’re shellfish.","type":"general"},
  {"id":52,"joke":"The rotation of Earth really makes my day.","type":"general"},
  {"id":53,"joke":"Why was the math book sad? Too many problems.","type":"general"},
  {"id":54,"joke":"What’s brown and sticky? A stick.","type":"general"},
  {"id":55,"joke":"Did you hear about the kidnapping? He woke up.","type":"general"},
  {"id":56,"joke":"Why do cows wear bells? Because their horns don’t work.","type":"general"},
  {"id":57,"joke":"How do you organize a space party? You planet.","type":"general"},
  {"id":58,"joke":"I told my friend to stop acting like a flamingo. He had to put his foot down.","type":"general"},
  {"id":59,"joke":"What do you call a bear with no teeth? A gummy bear.","type":"general"},
  {"id":60,"joke":"I bought shoes from a drug dealer. I don’t know what he laced them with, but I’ve been tripping.","type":"general"},
  {"id":61,"joke":"Why don’t skeletons fight? They don’t have the guts.","type":"general"},
  {"id":62,"joke":"I’m reading a book about anti-gravity. It’s impossible to put down.","type":"general"},
  {"id":63,"joke":"Why can’t bicycles stand by themselves? They’re two-tired.","type":"general"},
  {"id":64,"joke":"Why did the coffee file a police report? It got mugged.","type":"general"},
  {"id":65,"joke":"I ate a clock today. It was very time-consuming.","type":"general"},
  {"id":66,"joke":"I used to be addicted to soap, but I’m clean now.","type":"general"},
  {"id":67,"joke":"Why was 6 afraid of 7? Because 7 ate 9.","type":"general"},
  {"id":68,"joke":"Why did the cookie go to the doctor? It felt crummy.","type":"general"},
  {"id":69,"joke":"I stayed up all night wondering where the sun went. Then it dawned on me.","type":"general"},
  {"id":70,"joke":"What do you call cheese that isn’t yours? Nacho cheese.","type":"general"},
  {"id":71,"joke":"Why did the man run around his bed? He wanted to catch up on sleep.","type":"general"},
  {"id":72,"joke":"What did one hat say to the other? You stay here, I’ll go on ahead.","type":"general"},
  {"id":73,"joke":"I renamed my dog Five Miles so I can say I walk Five Miles every day.","type":"general"},
  {"id":74,"joke":"How do penguins build their houses? Igloo it together.","type":"general"},
  {"id":75,"joke":"Why was the broom late? It swept in.","type":"general"},
  {"id":76,"joke":"I’m so good at sleeping, I can do it with my eyes closed.","type":"general"},
  {"id":77,"joke":"Why did the fisherman get bad grades? Because he was below sea level.","type":"general"},
  {"id":78,"joke":"Why did the cookie cry? His mother was a wafer too long.","type":"general"},
  {"id":79,"joke":"I tried to make a belt out of watches. It was a waist of time.","type":"general"},
  {"id":80,"joke":"Why did the music teacher go to jail? She got caught with too many notes.","type":"general"},
  {"id":81,"joke":"Why don’t some couples go to the gym? Some relationships don’t work out.","type":"general"},
  {"id":82,"joke":"What do you call a chicken staring at lettuce? Chicken sees-a-salad.","type":"general"},
  {"id":83,"joke":"How does a snowman get around? By riding an icicle.","type":"general"},
  {"id":84,"joke":"Why did the man bring a ladder to the bar? He heard the drinks were on the house.","type":"general"},
  {"id":85,"joke":"I told my dog a joke. He didn’t get it — it was too paw-sitive.","type":"general"},
  {"id":86,"joke":"Why did the picture go to jail? It was framed.","type":"general"},
  {"id":87,"joke":"My pillow and I are in a committed relationship. It supports me every night.","type":"general"},
  {"id":88,"joke":"Why did the scarecrow become a detective? He was outstanding in his field.","type":"general"},
  {"id":89,"joke":"Why don’t bananas snore? They don’t want to wake up the bunch.","type":"general"},
  {"id":90,"joke":"What do you call a cold dog? A chili dog.","type":"general"},
  {"id":91,"joke":"Why was the computer sneezing? It had a virus.","type":"general"},
  {"id":92,"joke":"Why did the clock get stressed? It was running out of time.","type":"general"},
  {"id":93,"joke":"Why don’t mountains get cold? They wear snow caps.","type":"general"},
  {"id":94,"joke":"Why did the chicken join a band? It had drumsticks.","type":"general"},
  {"id":95,"joke":"What happens when frogs park illegally? They get toad.","type":"general"},
  {"id":96,"joke":"Why did the man sit on his watch? He wanted to be on time.","type":"general"},
  {"id":97,"joke":"Why did the soap fail the exam? It was too slippery.","type":"general"},
  {"id":98,"joke":"Why do painters always fall for their models? They’re drawn to them.","type":"general"},
  {"id":99,"joke":"Why did the phone need glasses? It lost all its contacts.","type":"general"},
  {"id":100,"joke":"Why was the fisherman a good comedian? He always had the best lines.","type":"general"},
    {"id":101,"joke":"Why don’t keyboards sleep? They have two shifts.","type":"general"},
  {"id":102,"joke":"What do you call a lazy kangaroo? A pouch potato.","type":"general"},
  {"id":103,"joke":"Why did the pencil go to the doctor? It had a broken point.","type":"general"},
  {"id":104,"joke":"What do you call a cow with no legs? Ground beef.","type":"general"},
  {"id":105,"joke":"Why did the scarecrow start a podcast? He had a lot of straw-tistics to share.","type":"general"},
  {"id":106,"joke":"Why did the cookie sit in the shade? It didn’t want to crumble.","type":"general"},
  {"id":107,"joke":"Why do candles always go on dates? They like to have a warm time.","type":"general"},
  {"id":108,"joke":"What do you call a dinosaur with an extensive vocabulary? A thesaurus.","type":"general"},
  {"id":109,"joke":"Why can’t you give Elsa a balloon? Because she will let it go.","type":"general"},
  {"id":110,"joke":"Why did the smartphone go to therapy? Too many hang-ups.","type":"general"},
  {"id":111,"joke":"What do you call the king of vegetables? The carrot-taker.","type":"general"},
  {"id":112,"joke":"Why did the squirrel take a nap? It was nut-tired.","type":"general"},
  {"id":113,"joke":"Why do birds fly south for the winter? Because it’s faster than walking.","type":"general"},
  {"id":114,"joke":"Why don’t ghosts lie? They are too transparent.","type":"general"},
  {"id":115,"joke":"Why did the grape stop in the middle of the road? It ran out of juice.","type":"general"},
  {"id":116,"joke":"Why do bananas never feel lonely? They hang out in bunches.","type":"general"},
  {"id":117,"joke":"Why was the robot tired? It had too many bytes of work.","type":"general"},
  {"id":118,"joke":"What do you call a cow in an earthquake? A milkshake.","type":"general"},
  {"id":119,"joke":"Why did the candle fail the test? It burned out.","type":"general"},
  {"id":120,"joke":"Why don’t calendars tell secrets? They’re always showing dates.","type":"general"},
  {"id":121,"joke":"What do you call a fish with a crown? King Neptune.","type":"general"},
  {"id":122,"joke":"Why did the TV break up with the remote? It felt controlled.","type":"general"},
  {"id":123,"joke":"Why did the coffee taste like mud? Because it was ground just moments ago.","type":"general"},
  {"id":124,"joke":"What do you call a sheep with no legs? A cloud.","type":"general"},
  {"id":125,"joke":"Why did the broom flunk school? It swept too much.","type":"general"},
  {"id":126,"joke":"Why did the chef bring a ladder to the kitchen? To reach the high steaks.","type":"general"},
  {"id":127,"joke":"What do you call a pig who knows karate? A pork chop.","type":"general"},
  {"id":128,"joke":"Why don’t clocks get along? They always tick each other off.","type":"general"},
  {"id":129,"joke":"Why did the window go to therapy? It couldn’t handle the pressure.","type":"general"},
  {"id":130,"joke":"What do you call a snowman with a temper? A meltdown.","type":"general"},
  {"id":131,"joke":"Why do seagulls fly over the ocean? Because if they flew over the bay, they’d be bagels.","type":"general"},
  {"id":132,"joke":"Why did the belt go to jail? It held up a pair of pants.","type":"general"},
  {"id":133,"joke":"What do you call a potato with glasses? A spec-tater.","type":"general"},
  {"id":134,"joke":"Why did the stadium get hotter? All the fans left.","type":"general"},
  {"id":135,"joke":"Why did the car apply for a job? It wanted to get driven.","type":"general"},
  {"id":136,"joke":"What do you call a dancing sheep? A baa-llerina.","type":"general"},
  {"id":137,"joke":"Why did the barber invest in stocks? He wanted to trim losses.","type":"general"},
  {"id":138,"joke":"Why couldn’t the bicycle find its way home? It lost its bearings.","type":"general"},
  {"id":139,"joke":"Why was the cookie so calm? It knew crumbling wouldn’t solve anything.","type":"general"},
  {"id":140,"joke":"Why don’t koalas get invited to parties? They’re bear-ly social.","type":"general"},
  {"id":141,"joke":"Why did the fish blush? It saw the ocean’s bottom.","type":"general"},
  {"id":142,"joke":"Why don’t chickens like people? They always egg them on.","type":"general"},
  {"id":143,"joke":"Why do math teachers love parks? They’re full of natural logs.","type":"general"},
  {"id":144,"joke":"Why did the clock go to therapy? It couldn’t handle alarms.","type":"general"},
  {"id":145,"joke":"Why did the soil get rich? It had a lot of dirt on people.","type":"general"},
  {"id":146,"joke":"Why did the phone break up with Wi-Fi? There was no connection.","type":"general"},
  {"id":147,"joke":"Why did the mosquito get a job? It needed to pay the blood bills.","type":"general"},
  {"id":148,"joke":"What do you call a sleeping dinosaur? A dino-snore.","type":"general"},
  {"id":149,"joke":"Why did the power outlet get nervous? Too many plugs were watching.","type":"general"},
  {"id":150,"joke":"Why did the tomato turn smart? It finally caught up.","type":"general"},
  {"id":151,"joke":"Why did the sandwich go to the gym? To get toasted.","type":"general"},
  {"id":152,"joke":"Why did the cloud win an award? It was outstanding in its atmosphere.","type":"general"},
  {"id":153,"joke":"What do you call a singing computer? A Dell.","type":"general"},
  {"id":154,"joke":"Why don’t tigers play poker? Too many cheetahs.","type":"general"},
  {"id":155,"joke":"Why do buttons always argue? They can never agree on a point.","type":"general"},
  {"id":156,"joke":"Why did the dolphin fail school? It kept blowing bubbles instead of studying.","type":"general"},
  {"id":157,"joke":"What do you call a cow spying on you? A steak-out.","type":"general"},
  {"id":158,"joke":"Why don’t bees ever get married? They can’t find the right buzz.","type":"general"},
  {"id":159,"joke":"Why did the egg sit alone? It didn’t want to scramble relationships.","type":"general"},
  {"id":160,"joke":"What do you call a bear stuck in the rain? A drizzly bear.","type":"general"},
  {"id":161,"joke":"Why did the toaster break up with the bread? It felt used.","type":"general"},
  {"id":162,"joke":"Why did the shovel break up with the rake? It felt like it was being dragged.","type":"general"},
  {"id":163,"joke":"What do you call a fly with no wings? A walk.","type":"general"},
  {"id":164,"joke":"Why don’t keyboards stay calm? They’re always under pressure.","type":"general"},
  {"id":165,"joke":"Why was the calculator shy? It couldn’t function under pressure.","type":"general"},
  {"id":166,"joke":"What do you call an alligator wearing a vest? An investigator.","type":"general"},
  {"id":167,"joke":"Why did the astronaut break up? He needed space.","type":"general"},
  {"id":168,"joke":"Why was the light bulb bad at secrets? It always blurted out ideas.","type":"general"},
  {"id":169,"joke":"What do you call a sleeping robot? A power napper.","type":"general"},
  {"id":170,"joke":"Why did the cookie stop dancing? It felt crumby.","type":"general"},
  {"id":171,"joke":"Why was the mirror stressed? It was reflecting too much.","type":"general"},
  {"id":172,"joke":"Why did the dolphin bring a towel? In case it got wet.","type":"general"},
  {"id":173,"joke":"What do you call a vegetable that’s also a pet? A carrot-dog.","type":"general"},
  {"id":174,"joke":"Why couldn’t the leopard hide? It was always spotted.","type":"general"},
  {"id":175,"joke":"Why did the snowman call for help? He was chilling too much.","type":"general"},
  {"id":176,"joke":"Why did the mountain get in trouble? It peaked too early.","type":"general"},
  {"id":177,"joke":"What do you call a deer with no eyes? No-eye-deer.","type":"general"},
  {"id":178,"joke":"Why did the bakery hire a detective? Too many muffins went missing.","type":"general"},
  {"id":179,"joke":"What do you call a bird at a construction site? A crane.","type":"general"},
  {"id":180,"joke":"Why was the pillow bad at arguments? It always softened the blow.","type":"general"},
  {"id":181,"joke":"Why did the flower break up with the bee? It wanted more space to grow.","type":"general"},
  {"id":182,"joke":"Why was the elephant so polite? It had good tusk-manners.","type":"general"},
  {"id":183,"joke":"Why did the cereal get promoted? It was outstanding in its bowl.","type":"general"},
  {"id":184,"joke":"What do you call a camel with no humps? Humphrey.","type":"general"},
  {"id":185,"joke":"Why did the candle stay home? It didn’t want to get burned out.","type":"general"},
  {"id":186,"joke":"Why was the ocean so calm? It had plenty of waves to relax.","type":"general"},
  {"id":187,"joke":"What do you call a fish that loves basketball? A slam-dunk eel.","type":"general"},
  {"id":188,"joke":"Why was the pen jealous? It wanted to make a point.","type":"general"},
  {"id":189,"joke":"Why did the balloon go to school? It wanted to be bright.","type":"general"},
  {"id":190,"joke":"Why do spiders make great web designers? They love spinning.","type":"general"},
  {"id":191,"joke":"Why was the mushroom invited to the party? He was a fun-gi.","type":"general"},
  {"id":192,"joke":"What do you call a robot that likes jokes? A laugh-bot.","type":"general"},
  {"id":193,"joke":"Why did the lemon apply for a job? It wanted to make lemonade.","type":"general"},
  {"id":194,"joke":"Why did the bear stop using social media? Too many paws in the comments.","type":"general"},
  {"id":195,"joke":"Why was the ghost a bad liar? It was easy to see through.","type":"general"},
  {"id":196,"joke":"Why did the turtle cross the road slowly? It had no shell-phone.","type":"general"},
  {"id":197,"joke":"Why don’t skeletons use cell phones? They don’t have any body to call.","type":"general"},
  {"id":198,"joke":"Why was the avocado sad? It felt empty inside.","type":"general"},
  {"id":199,"joke":"Why did the bee go to therapy? Too many buzz-killers.","type":"general"},
  {"id":200,"joke":"Why did the frog call his insurance? His car had a jump start.","type":"general"},
  {"id":201,"joke":"Why did the gardener quit? His celery wasn’t high enough.","type":"general"},
  {"id":202,"joke":"Why do lemons never win races? They always peel out.","type":"general"},
  {"id":203,"joke":"Why did the window start a band? It had great pane skills.","type":"general"},
  {"id":204,"joke":"Why was the vacuum cleaner so serious? It sucked the fun out of everything.","type":"general"},
  {"id":205,"joke":"Why was the cookie a great singer? It knew all the crumby notes.","type":"general"},
  {"id":206,"joke":"What do you call a cow on a trampoline? A bouncing beef.","type":"general"},
  {"id":207,"joke":"Why don’t volcanoes get jobs? They keep erupting.","type":"general"},
  {"id":208,"joke":"Why did the toy go to school? It wanted to be smarter.","type":"general"},
  {"id":209,"joke":"Why was the table tired? It had too many legs to support.","type":"general"},
  {"id":210,"joke":"Why did the leaf get promoted? It made a great impression.","type":"general"},
  {"id":211,"joke":"What do you call a detective potato? A chip-officer.","type":"general"},
  {"id":212,"joke":"Why did the coffee bean go to therapy? It had too many espresso-ed feelings.","type":"general"},
  {"id":213,"joke":"Why did the spider get promoted? It was good at networking.","type":"general"},
  {"id":214,"joke":"Why was the lizard so calm? It could handle reptile dysfunction.","type":"general"},
  {"id":215,"joke":"What do you call a sad strawberry? A blueberry.","type":"general"},
  {"id":216,"joke":"Why did the notebook feel overwhelmed? Too many notes.","type":"general"},
  {"id":217,"joke":"What do you call a cow that sings? A moo-sician.","type":"general"},
  {"id":218,"joke":"Why did the peanut go to the police? It was assaulted.","type":"general"},
  {"id":219,"joke":"What do you call a rabbit that tells jokes? A funny bunny.","type":"general"},
  {"id":220,"joke":"What do you call an owl magician? Hoo-dini.","type":"general"},
  {"id":221,"joke":"Why did the bicycle look sad? It was two-tired.","type":"general"},
  {"id":222,"joke":"What do you call a nervous javelin thrower? Shakespeare.","type":"general"},
  {"id":223,"joke":"Why did the dog sit in the shade? It didn’t want to be a hot dog.","type":"general"},
  {"id":224,"joke":"What do you call a ghost with good manners? Properly polite-ghoul.","type":"general"},
  {"id":225,"joke":"Why did the shoe apply for a job? It wanted to fit in.","type":"general"},
  {"id":226,"joke":"Why was the noodle so wise? It pasta lot.","type":"general"},
  {"id":227,"joke":"What do you call a singing fish? A tuna.","type":"general"},
  {"id":228,"joke":"Why do ghosts love elevators? It lifts their spirits.","type":"general"},
  {"id":229,"joke":"Why did the spider join the band? It had great rhythm.","type":"general"},
  {"id":230,"joke":"Why was the snowman a good comedian? He delivered cool jokes.","type":"general"},
  {"id":231,"joke":"Why did the buffalo bring a ladder? To reach the high plains.","type":"general"},
  {"id":232,"joke":"Why was the dentist always calm? He knew the drill.","type":"general"},
  {"id":233,"joke":"Why did the banana call 911? It was in a split situation.","type":"general"},
  {"id":234,"joke":"Why was the keyboard so loud? It had too many caps.","type":"general"},
  {"id":235,"joke":"Why did the plant go to therapy? It had too many roots.","type":"general"},
  {"id":236,"joke":"Why did the soda bottle get nervous? Too much fizz pressure.","type":"general"},
  {"id":237,"joke":"What do you call the boss of tissue paper? The head honcho.","type":"general"},
  {"id":238,"joke":"Why did the cow go on vacation? To moo-relax.","type":"general"},
  {"id":239,"joke":"Why did the tree start a blog? It had a lot of branches of knowledge.","type":"general"},
  {"id":240,"joke":"Why did the broom get promoted? It swept through expectations.","type":"general"},
  {"id":241,"joke":"Why was the cat good at video games? It had nine lives.","type":"general"},
  {"id":242,"joke":"Why did the watch apply for school? It wanted to be on time.","type":"general"},
  {"id":243,"joke":"Why was the math book happy? It finally solved its problems.","type":"general"},
  {"id":244,"joke":"What do you call a dog that can do magic? A Labracadabrador.","type":"general"},
  {"id":245,"joke":"Why did the shirt go to school? It wanted to be well-pressed.","type":"general"},
  {"id":246,"joke":"Why did the banana get picked for the team? It had great appeal.","type":"general"},
  {"id":247,"joke":"What do you call a car that sings? A carbure-tune.","type":"general"},
  {"id":248,"joke":"Why did the owl stay calm? It didn’t give a hoot.","type":"general"},
  {"id":249,"joke":"Why did the balloon laugh? It was pumped.","type":"general"},
  {"id":250,"joke":"Why did the plant break up? It needed more sunlight in its life.","type":"general"},
  {"id":251,"joke":"Why was the lamp so smart? It had bright ideas.","type":"general"},
  {"id":252,"joke":"What do you call a tired ninja? A slow-motion assassin.","type":"general"},
  {"id":253,"joke":"Why was the bread so relaxing? It always loafed around.","type":"general"},
  {"id":254,"joke":"What do you call a crocodile in a vest? An investigator.","type":"general"},
  {"id":255,"joke":"Why did the cereal sit quietly? It was feeling grainy.","type":"general"},
  {"id":256,"joke":"Why did the ice cream go to school? It wanted to be cooler.","type":"general"},
  {"id":257,"joke":"What do you call a spooky dog? A terrorier.","type":"general"},
  {"id":258,"joke":"Why did the ruler break up? It couldn’t measure up.","type":"general"},
  {"id":259,"joke":"Why was the water bottle so calm? It went with the flow.","type":"general"},
  {"id":260,"joke":"Why did the plant get invited? It had a blooming personality.","type":"general"},
  {"id":261,"joke":"Why did the paper feel stressed? Too many issues.","type":"general"},
  {"id":262,"joke":"Why was the fridge good at relationships? It kept things cool.","type":"general"},
  {"id":263,"joke":"Why did the turtle join a band? It had a great shell rhythm.","type":"general"},
  {"id":264,"joke":"Why did the banana stay calm? It didn’t want to split.","type":"general"},
  {"id":265,"joke":"Why did the robot go to the beach? To recharge.","type":"general"},
  {"id":266,"joke":"Why did the hammer break up with the nail? Too much pressure.","type":"general"},
  {"id":267,"joke":"Why was the pizza so popular? It had a crustworthy personality.","type":"general"},
  {"id":268,"joke":"Why did the egg refuse to fight? It didn’t want to crack.","type":"general"},
  {"id":269,"joke":"Why do trees hate tests? They get stumped.","type":"general"},
  {"id":270,"joke":"Why did the milk go to therapy? It felt spoiled.","type":"general"},
  {"id":271,"joke":"Why did the cookie apply for a loan? It needed dough.","type":"general"},
  {"id":272,"joke":"What do you call a lost wolf? A where-wolf.","type":"general"},
  {"id":273,"joke":"What do you call a cow in space? An astro-cow.","type":"general"},
  {"id":274,"joke":"Why did the orange join the circus? It had great zest.","type":"general"},
  {"id":275,"joke":"Why did the book go to the gym? To build its spine.","type":"general"},
  {"id":276,"joke":"Why did the fish avoid talking? It didn’t want to open a can of worms.","type":"general"},
  {"id":277,"joke":"Why was the glue so confident? It knew people stuck around.","type":"general"},
  {"id":278,"joke":"What do you call a sleeping bull? A bulldozer.","type":"general"},
  {"id":279,"joke":"Why was the camera happy? It captured great moments.","type":"general"},
  {"id":280,"joke":"Why did the computer eat a snack? It had a byte.","type":"general"},
  {"id":281,"joke":"Why did the stapler go to the gym? To get stronger bonds.","type":"general"},
  {"id":282,"joke":"What do you call a snake that builds things? A boa-constructor.","type":"general"},
  {"id":283,"joke":"Why did the ruler feel lonely? It had no one to measure up to.","type":"general"},
  {"id":284,"joke":"Why did the hat go to school? To get ahead.","type":"general"},
  {"id":285,"joke":"Why was the fork bad at sports? Too many points.","type":"general"},
  {"id":286,"joke":"What do you call a shark that loves fast food? A drive-thru-rren.","type":"general"},
  {"id":287,"joke":"Why did the chair go to therapy? It needed support.","type":"general"},
  {"id":288,"joke":"Why was the computer great at singing? It had good bytes.","type":"general"},
  {"id":289,"joke":"What do you call a group of musical whales? An orca-stra.","type":"general"},
  {"id":290,"joke":"Why did the fish blush? It saw the seaweed changing.","type":"general"},
  {"id":291,"joke":"What do you call a bird that can fix things? A duck-tor.","type":"general"},
  {"id":292,"joke":"Why did the tomato go to school? To ketchup on knowledge.","type":"general"},
  {"id":293,"joke":"Why was the banana scared? It didn’t want to slip up.","type":"general"},
  {"id":294,"joke":"Why did the loaf of bread stay calm? It knew everything would pan out.","type":"general"},
  {"id":295,"joke":"Why did the watch get promoted? It had good time-management.","type":"general"},
  {"id":296,"joke":"Why was the cereal always happy? It lived a bowl-full life.","type":"general"},
  {"id":297,"joke":"Why did the strawberry call the police? It was in a jam.","type":"general"},
  {"id":298,"joke":"Why did the frog read a book? It wanted to improve its ribbit-ing.","type":"general"},
  {"id":299,"joke":"Why did the blanket get promoted? It covered everything.","type":"general"},
  {"id":300,"joke":"Why did the desk feel stressed? Too many drawers of responsibility.","type":"general"}
]
