[
  {"id":1,"joke":"Why don’t eggs tell jokes? They’d crack each other up.","type":"general"},
  {"id":2,"joke":"I used to play piano by ear, but now I use my hands.","type":"general"},
  {"id":3,"joke":"Why did the invisible man turn down the job? He couldn’t see himself doing it.","type":"general"},
  {"id":4,"joke":"I told my suitcase we’re not going on vacation. Now it’s emotional baggage.","type":"general"},
  {"id":5,"joke":"Why did the barber win the race? He took a short cut.","type":"general"},
  {"id":6,"joke":"I’m reading a book about mazes. I’m getting lost in it.","type":"general"},
  {"id":7,"joke":"Why did the skeleton go to the party alone? He had no body to go with.","type":"general"},
  {"id":8,"joke":"I don’t trust trees. They seem kind of shady.","type":"general"},
  {"id":9,"joke":"Why was the broom promoted? It swept the competition.","type":"general"},
  {"id":10,"joke":"I told my friend 10 jokes to make him laugh. Sadly, no pun in ten did.","type":"general"},
  {"id":11,"joke":"Why did the orange stop? It ran out of juice.","type":"general"},
  {"id":12,"joke":"Why was the calendar nervous? Its days were numbered.","type":"general"},
  {"id":13,"joke":"I quit my job at the helium factory. I refused to be spoken to in that tone.","type":"general"},
  {"id":14,"joke":"Why don’t scientists trust stairs? They’re always up to something.","type":"general"},
  {"id":15,"joke":"The baker quit his job. He couldn’t make enough dough.","type":"general"},
  {"id":16,"joke":"Why do bees have sticky hair? Because they use honeycombs.","type":"general"},
  {"id":17,"joke":"I bought a boat because it was on sail.","type":"general"},
  {"id":18,"joke":"Why don’t some fish get good grades? They work below sea level.","type":"general"},
  {"id":19,"joke":"I used to be a banker, but I lost interest.","type":"general"},
  {"id":20,"joke":"Why did the banana go to the doctor? It wasn’t peeling well.","type":"general"},
  {"id":21,"joke":"I told my computer I needed a break, and now it won’t stop sending me kit-kats.","type":"general"},
  {"id":22,"joke":"Why was the stadium so cool? It was filled with fans.","type":"general"},
  {"id":23,"joke":"What do you call a boomerang that doesn’t come back? A stick.","type":"general"},
  {"id":24,"joke":"I’m on a seafood diet. I see food and I eat it.","type":"general"},
  {"id":25,"joke":"Why did the tomato turn red? It saw the salad dressing.","type":"general"},
  {"id":26,"joke":"What do you call a sleeping bull? A bulldozer.","type":"general"},
  {"id":27,"joke":"Why did the golfer bring two pants? In case he got a hole in one.","type":"general"},
  {"id":28,"joke":"I used to hate facial hair, but then it grew on me.","type":"general"},
  {"id":29,"joke":"Why don’t crabs donate? They’re shellfish.","type":"general"},
  {"id":30,"joke":"I couldn’t figure out why my car was acting funny — then it hit me.","type":"general"},
  {"id":31,"joke":"What do you call a factory that makes okay products? A satisfactory.","type":"general"},
  {"id":32,"joke":"Why did the bicycle fall over? It was two-tired.","type":"general"},
  {"id":33,"joke":"I tried to catch fog yesterday. Mist.","type":"general"},
  {"id":34,"joke":"What do clouds wear? Thunderwear.","type":"general"},
  {"id":35,"joke":"Why was the belt arrested? It held up a pair of pants.","type":"general"},
  {"id":36,"joke":"I told a joke about a bed. It hasn’t been made yet.","type":"general"},
  {"id":37,"joke":"What do you call fake noodles? An impasta.","type":"general"},
  {"id":38,"joke":"Why don’t vampires go to barbecues? They don’t like steaks.","type":"general"},
  {"id":39,"joke":"Why was the cookie sad? It felt crumby.","type":"general"},
  {"id":40,"joke":"What kind of music do planets like? Neptunes.","type":"general"},
  {"id":41,"joke":"Why can’t you trust atoms? They make up everything.","type":"general"},
  {"id":42,"joke":"Why was the computer cold? It forgot to close its windows.","type":"general"},
  {"id":43,"joke":"What did the grape do when stepped on? Nothing, it just let out a little wine.","type":"general"},
  {"id":44,"joke":"I used to have a job crushing cans. It was soda pressing.","type":"general"},
  {"id":45,"joke":"Why did the scarecrow win an award? He was outstanding in his field.","type":"general"},
  {"id":46,"joke":"My dog ate my homework, so I ate my dog’s food. Fair trade.","type":"general"},
  {"id":47,"joke":"Why don’t melons get married? They cantaloupe.","type":"general"},
  {"id":48,"joke":"I told my wife she drew her eyebrows too high. She looked surprised.","type":"general"},
  {"id":49,"joke":"I told a chemistry joke, but I got no reaction.","type":"general"},
  {"id":50,"joke":"Why are elevator jokes so good? They work on many levels.","type":"general"},
  {"id":51,"joke":"Why don’t oysters share? Because they’re shellfish.","type":"general"},
  {"id":52,"joke":"The rotation of Earth really makes my day.","type":"general"},
  {"id":53,"joke":"Why was the math book sad? Too many problems.","type":"general"},
  {"id":54,"joke":"What’s brown and sticky? A stick.","type":"general"},
  {"id":55,"joke":"Did you hear about the kidnapping? He woke up.","type":"general"},
  {"id":56,"joke":"Why do cows wear bells? Because their horns don’t work.","type":"general"},
  {"id":57,"joke":"How do you organize a space party? You planet.","type":"general"},
  {"id":58,"joke":"I told my friend to stop acting like a flamingo. He had to put his foot down.","type":"general"},
  {"id":59,"joke":"What do you call a bear with no teeth? A gummy bear.","type":"general"},
  {"id":60,"joke":"I bought shoes from a drug dealer. I don’t know what he laced them with, but I’ve been tripping.","type":"general"},
  {"id":61,"joke":"Why don’t skeletons fight? They don’t have the guts.","type":"general"},
  {"id":62,"joke":"I’m reading a book about anti-gravity. It’s impossible to put down.","type":"general"},
  {"id":63,"joke":"Why can’t bicycles stand by themselves? They’re two-tired.","type":"general"},
  {"id":64,"joke":"Why did the coffee file a police report? It got mugged.","type":"general"},
  {"id":65,"joke":"I ate a clock today. It was very time-consuming.","type":"general"},
  {"id":66,"joke":"I used to be addicted to soap, but I’m clean now.","type":"general"},
  {"id":67,"joke":"Why was 6 afraid of 7? Because 7 ate 9.","type":"general"},
  {"id":68,"joke":"Why did the cookie go to the doctor? It felt crummy.","type":"general"},
  {"id":69,"joke":"I stayed up all night wondering where the sun went. Then it dawned on me.","type":"general"},
  {"id":70,"joke":"What do you call cheese that isn’t yours? Nacho cheese.","type":"general"},
  {"id":71,"joke":"Why did the man run around his bed? He wanted to catch up on sleep.","type":"general"},
  {"id":72,"joke":"What did one hat say to the other? You stay here, I’ll go on ahead.","type":"general"},
  {"id":73,"joke":"I renamed my dog Five Miles so I can say I walk Five Miles every day.","type":"general"},
  {"id":74,"joke":"How do penguins build their houses? Igloo it together.","type":"general"},
  {"id":75,"joke":"Why was the broom late? It swept in.","type":"general"},
  {"id":76,"joke":"I’m so good at sleeping, I can do it with my eyes closed.","type":"general"},
  {"id":77,"joke":"Why did the fisherman get bad grades? Because he was below sea level.","type":"general"},
  {"id":78,"joke":"Why did the cookie cry? His mother was a wafer too long.","type":"general"},
  {"id":79,"joke":"I tried to make a belt out of watches. It was a waist of time.","type":"general"},
  {"id":80,"joke":"Why did the music teacher go to jail? She got caught with too many notes.","type":"general"},
  {"id":81,"joke":"Why don’t some couples go to the gym? Some relationships don’t work out.","type":"general"},
  {"id":82,"joke":"What do you call a chicken staring at lettuce? Chicken sees-a-salad.","type":"general"},
  {"id":83,"joke":"How does a snowman get around? By riding an icicle.","type":"general"},
  {"id":84,"joke":"Why did the man bring a ladder to the bar? He heard the drinks were on the house.","type":"general"},
  {"id":85,"joke":"I told my dog a joke. He didn’t get it — it was too paw-sitive.","type":"general"},
  {"id":86,"joke":"Why did the picture go to jail? It was framed.","type":"general"},
  {"id":87,"joke":"My pillow and I are in a committed relationship. It supports me every night.","type":"general"},
  {"id":88,"joke":"Why did the scarecrow become a detective? He was outstanding in his field.","type":"general"},
  {"id":89,"joke":"Why don’t bananas snore? They don’t want to wake up the bunch.","type":"general"},
  {"id":90,"joke":"What do you call a cold dog? A chili dog.","type":"general"},
  {"id":91,"joke":"Why was the computer sneezing? It had a virus.","type":"general"},
  {"id":92,"joke":"Why did the clock get stressed? It was running out of time.","type":"general"},
  {"id":93,"joke":"Why don’t mountains get cold? They wear snow caps.","type":"general"},
  {"id":94,"joke":"Why did the chicken join a band? It had drumsticks.","type":"general"},
  {"id":95,"joke":"What happens when frogs park illegally? They get toad.","type":"general"},
  {"id":96,"joke":"Why did the man sit on his watch? He wanted to be on time.","type":"general"},
  {"id":97,"joke":"Why did the soap fail the exam? It was too slippery.","type":"general"},
  {"id":98,"joke":"Why do painters always fall for their models? They’re drawn to them.","type":"general"},
  {"id":99,"joke":"Why did the phone need glasses? It lost all its contacts.","type":"general"},
  {"id":100,"joke":"Why was the fisherman a good comedian? He always had the best lines.","type":"general"}
]
